{
  "blogs": [
    {
      "id": "1",
      "title": "Running a Node App",
      "author": "jessjelly",
      "body": "This is part two of a series on how to get up and running with Systemd and Node.js. This part dives deeper into how to successfully run your app with systemd long-term, and how to set it up in a production environment.",
      "imageUrl": "https://images.pexels.com/photos/11035380/pexels-photo-11035380.jpeg?w=700&h=700"
    },
    {
      "id": "2",
      "title": "The Rise Of Thinking Machines: How IBM's Watson Takes On The World",
      "author": "jessjelly",
      "body": "Many people know Watson as the IBM-developed cognitive super computer that won the Jeopardy! gameshow in 2011. In truth, Watson is not actually a computer but a set of algorithms and APIs, and since winning TV fame (and a $1 million prize) IBM has put it to use tackling tough problems in every industry from healthcare to finance. Most recently, IBM has announced several new partnerships which aim to take things even further, and put its cognitive capabilities to use solving a whole new range of problems around the world.",
      "imageUrl": "https://images.pexels.com/photos/373543/pexels-photo-373543.jpeg?w=700&h=700"
    },
    {
      "id": "3",
      "title": "22 Amazing open source React projects",
      "author": "happyamy2016",
      "body": "This is a collection of open source apps built with React.JS library. In this observation, we compared nearly 800 projects to pick the top 22. (React Native: 11, React: 11). To evaluate the quality, Mybridge AI considered a variety of factors to determine how useful the projects are for programmers. To give you an idea on the quality, the average number of Github stars from the 22 projects was 1,681.",
      "imageUrl": "https://images.pexels.com/photos/11035471/pexels-photo-11035471.jpeg?w=700&h=700"
    },
    {
      "title": "Making sense of Redux",
      "author": "jessjelly",
      "body": "When I first started learning React, I remember reading lots of articles about the different technologies associated with it. In particular, this one article stood out. It mentions how confusing the ecosystem is, and how developers often feel they have to know ALL of the ecosystem before using React. And as someone who’s used React daily for the past 8 months or so, I can definitely say that I’m still barely scratching the surface in terms of understanding how the entire ecosystem works! But my time spent using React has given me some insight into when and why it might be appropriate to use another technology — Redux (a variant of the Flux architecture).",
      "imageUrl ": "https://images.pexels.com/photos/4974912/pexels-photo-4974912.jpeg?w=700&h=700",
      "id": "94d3"
    },
    {
      "id": "4",
      "title": "Please stop worrying about Angular 3",
      "author": "jessjelly",
      "body": "Another Angular version planned already? Whaaaat? Didn’t Angular 2 just ship? Why Angular 3? What? Why? First off, there is no massive rewrite, and won’t be for Angular 3. Secondly, let me explain the future of Angular 2 and what Angular 3, Angular 4 will mean for you.",
      "imageUrl": "https://images.pexels.com/photos/14011035/pexels-photo-14011035.jpeg?w=700&h=700"
    },
    {
      "id": "5",
      "title": "JavaScript’s Apply, Call, and Bind Methods are Essential for JavaScript Professionals",
      "author": "grumpy19",
      "body": "Functions are objects in JavaScript, as you should know by now, if you have read any of the prerequisite articles. And as objects, functions have methods, including the powerful Apply, Call, and Bind methods. On the one hand, Apply and Call are nearly identical and are frequently used in JavaScript for borrowing methods and for setting the this value explicitly. We also use Apply for variable-arity functions; you will learn more about this in a bit.",
      "imageUrl": "https://images.pexels.com/photos/4383298/pexels-photo-4383298.jpeg?w=700&h=700"
    },
    {
      "id": "6",
      "title": "Using React Native: One Year Later",
      "author": "tickle122",
      "body": "When I interviewed for the iOS developer opening at Discord last spring, the tech lead Stanislav told me: React Native is the future. We will use it to build our iOS app from scratch as soon as it becomes public. As a native iOS developer, I strongly doubted using web technologies to build mobile apps because of my previous experiences with tools like PhoneGap. But after learning and using React Native for a while, I am glad we made that decision.",
      "imageUrl": "https://images.pexels.com/photos/6424586/pexels-photo-6424586.jpeg?w=700&h=700"
    },
    {
      "id": "5c02",
      "title": "dfgdgd",
      "body": "very long blog",
      "author": "sophiaR"
    },
    {
      "id": "bafe",
      "title": "adding real numbers in C# env",
      "body": "lsskfjs[ps sodopfiicksp",
      "author": "sophiaR",
      "imageUrl": "https://images.unsplash.com/photo-1684260757017-9ee0cf369413?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHx0b3BpYy1mZWVkfDEzfEUtLV9wbklpckc0fHxlbnwwfHx8fHw%3D"
    },
    {
      "id": "5d7e",
      "title": "Be Crreative",
      "body": "\"Creativity is seeing what others see and thinking what no one else ever thought.\" ...\n“Art is the elimination of the unnecessary.” ...\n\"You use a glass mirror to see your face. ...\n“A creative life is an amplified life. ...\n“Don't wait for inspiration. ...\n“The worst enemy to creativity is self-doubt.”",
      "author": "",
      "imageUrl": "https://images.unsplash.com/photo-1532072983668-720aad098512?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHx0b3BpYy1mZWVkfDI2fGFldTZyTC1qNmV3fHxlbnwwfHx8fHw%3D"
    },
    {
      "id": "b893",
      "title": "WHy do we like animals",
      "body": "One reason is that we are biologically oriented toward loving our children, and animals seem to us like children. Pets need help and appreciate our help. Also, they often provide us with affection. We expect less from animals than we do from adult humans, so we tend to be more satisfied with the critters.",
      "author": "sophiaR",
      "imageUrl": "https://images.unsplash.com/photo-1712482994282-8613bb4a8690?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHx0b3BpYy1mZWVkfDEwfEpwZzZLaWRsLUhrfHxlbnwwfHx8fHw%3D"
    }
  ]
}